In [6]:
import pandas as pd

In [7]:
data=pd.read_csv("/home/shreshtha/Downloads/test.csv")

In [10]:
data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [12]:
data.shape
#this is an attribute and not a method so no need to put parantheseshere
#df.info could givr additional info such as data types and is a method

(418, 11)

In [14]:
data.info()
#usually the object here means string

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [15]:
#to display all of our columns,
pd.set_option('display.max_columns',11)

In [28]:
#creating a dictonary with the key value pairs to learn about storing stuff and then using the same and exporting to dataframe
people={
    "ame" :  ["reshtha","Tanishka","Jalpa"],
    "mail" : ["abc@gmail.com","def@gmail.com","ghi@gmail.com"],
    "ast" : ["Hakkar","Modi","Patel"]
}

In [29]:
df=pd.DataFrame(people)

In [30]:
df
#thus we have created a df out of the dict and we can visualize the stuff better now and the left column is indexing

        ame           mail     ast
0   reshtha  abc@gmail.com  Hakkar
1  Tanishka  def@gmail.com    Modi
2     Jalpa  ghi@gmail.com   Patel

In [35]:
#accessing a single column
type(df['ame'])
#the series are basically the rows of a single column and a df is basically a container for multiple series

pandas.core.series.Series

In [39]:
#columns can also be found using data.columns
#rows can accessed using iloc which means using indexing as a location 
#can access multilpe rows using square brackets. in order to specify the columns we can specify it in the second outer bracket
#we can not use names here because it is iloc and looks for location

data.iloc[[0,5],2]

0              Kelly, Mr. James
5    Svensson, Mr. Johan Cervin
Name: Name, dtype: object

In [43]:
#we can search by label using loc and also can use column name instead of the column indexing
df.loc[[0,1],['mail']]

            mail
0  abc@gmail.com
1  def@gmail.com

In [45]:
data['Sex'].value_counts()
#INSTEAD of writing an entire functin and use loops, pandas has built in functonality for common functions

male      266
female    152
Name: Sex, dtype: int64

In [48]:
#can use slicing to grab multiple rows and columns
df.loc[0:2, 'mail']

0    abc@gmail.com
1    def@gmail.com
2    ghi@gmail.com
Name: mail, dtype: object

In [49]:
### indexing in pandas dataframe is mostly unique but if we want to lets say frame the index our way then we can do so by passing the parameter
#we need this functonality as sometimes lets say index is by first or last names in our data and they can be not unique sometimes
#if we want to index it using lets say phone numer or email we can also set the index using the same
df.set_index('mail')

                    ame     ast
mail
abc@gmail.com   reshtha  Hakkar
def@gmail.com  Tanishka    Modi
ghi@gmail.com     Jalpa   Patel